# Caption Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillSchemeEntry..::..Caption Property
ColorFillSchemeEntry Class See Also
---
The text displayed in [!:Autodesk::Revit::DB::ColorFillLegend] for this entry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public string Caption { get; set; }
```

Visual Basic
---
```text
Public Property Caption As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Caption {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
This property is only meaningful for by range scheme.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: newCaption is an empty string or contains only whitespace. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace